######################################################################################################################################################
# ファイル   : fgo_edit.py
# 
#-----------------------------------------------------------------------------------------------------------------------------------------------------
# 【修正履歴】
# V-001      : 2025/05/25                 Gamer-Iris   新規作成
# 
######################################################################################################################################################

# [環境設定エリア]
######################################################################################################################################################

# [定数定義エリア]
######################################################################################################################################################

# [変数定義エリア]
######################################################################################################################################################

# [前処理内容エリア]
######################################################################################################################################################

# [処理内容エリア]
######################################################################################################################################################
# fgo_editクラス
# @param  -
######################################################################################################################################################
class fgo_edit:

    ##################################################################################################################################################
    # sampleメソッド
    # @param  self               : self
    ##################################################################################################################################################
    def sample(self):
        print(self.function)

    ##################################################################################################################################################
    # コマンドセレクトメソッド
    # @param  self               : self
    ##################################################################################################################################################
    def select_command(self):

        # [サンプル]
        ###########################################################################################
        # キャラバフ１（バフ先が選択不可Ver）
        # （キャラ番号（実施者）：1、スキル番号（実施者）：1）
        # self.charBuff1(1, 1)
        # 
        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：1、スキル番号（実施者）：1 → キャラ番号（受領者）：1）
        # self.charBuff2(1, 1, 1)
        # 
        # マスタースキル１（バフ先が選択不可Ver）
        # （スキル番号：1）
        # self.masterSkill1(1)
        # 
        # マスタースキル２（バフ先が単体選択可Ver）
        # （スキル番号：1、キャラ番号：1）
        # self.masterSkill2(1, 1)
        # 
        # マスタースキル３（バフ先が2体選択可Ver）
        # （スキル番号：3、キャラ番号1：3、キャラ番号2：4）
        # self.masterSkill3(3, 3, 4)
        # 
        # エネミー選択１（エネミーが3体以下Ver）
        # （エネミー番号（右上から）：1）
        # self.selectEnemy1(1)
        #
        # エネミー選択２（エネミーが4体以上Ver）
        # （エネミー番号（右上から）：1）
        # self.selectEnemy2(1)
        # 
        # アタック１
        # （Attack回数：1、初回Attackフラグ：True）
        # self.attack1(1, True)
        # 
        # 宝具１（個人宝具Ver）
        # （キャラ番号：1、初回Attackフラグ：True）
        # self.hougu1(1, True)
        # 
        # 宝具２（複数人宝具Ver）
        # （キャラ番号：1～3、初回Attackフラグ：True）
        # self.hougu2([1,2,3], True)
        ###########################################################################################

        # 使用条件
        ###########################################################################################
        # ★キャラ
        # キャラ1：光のコヤンスカヤ　　　　（フリー）
        # キャラ2：アーキタイプアース　　　（カレスコ）
        # キャラ3：光のコヤンスカヤ　　　　（フリー）
        # 
        # ★魔術礼装
        # フリー
        ###########################################################################################

        ### 1ターン目 #############################################################################
        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：1、スキル番号（実施者）：2 → キャラ番号（受領者）：2）
        self.charBuff2(1, 2, 2)

        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：1、スキル番号（実施者）：3 → キャラ番号（受領者）：2）
        self.charBuff2(1, 3, 2)

        # キャラバフ１（バフ先が選択不可Ver）
        # （キャラ番号（実施者）：2、スキル番号（実施者）：1）
        self.charBuff1(2, 1)

        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：3、スキル番号（実施者）：2 → キャラ番号（受領者）：2）
        self.charBuff2(3, 2, 2)

        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：3、スキル番号（実施者）：3 → キャラ番号（受領者）：2）
        self.charBuff2(3, 3, 2)

        # 宝具１（個人宝具Ver）
        # （キャラ番号：2、初回Attackフラグ：True）
        self.hougu1(2, True)

        # アタック１
        # （Attack回数：2、初回Attackフラグ：False）
        self.attack1(2, False)

        ### 2ターン目 #############################################################################
        # キャラバフ１（バフ先が選択不可Ver）
        # （キャラ番号（実施者）：2、スキル番号（実施者）：2）
        self.charBuff1(2, 2)

        # キャラバフ１（バフ先が選択不可Ver）
        # （キャラ番号（実施者）：2、スキル番号（実施者）：3）
        self.charBuff1(2, 3)

        # 宝具１（個人宝具Ver）
        # （キャラ番号：2、初回Attackフラグ：True）
        self.hougu1(2, True)

        # アタック１
        # （Attack回数：2、初回Attackフラグ：False）
        self.attack1(2, False)

        ### 3ターン目 #############################################################################
        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：1、スキル番号（実施者）：1 → キャラ番号（受領者）：2）
        self.charBuff2(1, 1, 2)

        # キャラバフ２（バフ先が選択可Ver）
        # （キャラ番号（実施者）：3、スキル番号（実施者）：1 → キャラ番号（受領者）：2）
        self.charBuff2(3, 1, 2)

        # キャラバフ１（バフ先が選択不可Ver）
        # （キャラ番号（実施者）：2、スキル番号（実施者）：1）
        self.charBuff1(2, 1)

        # 宝具１（個人宝具Ver）
        # （キャラ番号：2、初回Attackフラグ：True）
        self.hougu1(2, True)

        # アタック１
        # （Attack回数：2、初回Attackフラグ：False）
        self.attack1(2, False)
